# WoodRadialNoise Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wood..::..WoodRadialNoise Property
Wood Class See Also
---
The property labeled "Radial Noise" from the "Wood" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WoodRadialNoise { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WoodRadialNoise As String
	Get
```

Visual C++
---
```text
public:
static property String^ WoodRadialNoise {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 100".
# See Also
Wood Class
Autodesk.Revit.DB.Visual Namespace